// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length >= 3) {
    alert('це великий масив, в якому  3 і більше елементи');
} else {
    alert('це маленький масив, в якому менше 3-х елементів');
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let numbers = [1, 55, 9];
if (numbers[0] < numbers[1] && numbers[0] > numbers[2]) {
    console.log('First is middle value');
} else if (numbers[1] < numbers[2] && numbers[1] > numbers[0]) {
    console.log('Second is middle value, it is between two numbers');
} else {
    console.log('Third is middle value');

}

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let a = 1;
let b = 1;
let result1 = a + b < 4 ? 'Мало' : 'Багато';
console.log(result1);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let someNumber = 10;
let res = (someNumber < 0) ? 'Negative number' : (someNumber > 0) ? 'Positive number' : 'OMG it is 0!';
console.log(res);

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = true;

if (test) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}
let testResult = test ? 'Вірно' : 'Неправильно';
console.log(testResult);

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let js = prompt('Яка «офіційна» назва JavaScript?');
if (js === 'ECMAScript') {
    console.log('Правильно!');
} else {
    console.log('Не знаєте? ECMAScript!');
}

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let flatNumber = 49;

if (flatNumber >= 1 && flatNumber <= 20) {
    console.log(1);
} else if (flatNumber >= 21 && flatNumber <= 48) {
    console.log(2);
} else {
    console.log(3);
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number = 5;
let numRes = number === 10 ? 'ВІРНО' : 'НЕВІРНО';
console.log(numRes);

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temp = 20;
if (temp >= 10 && temp <= 22) {
    console.log('ми йдемо ВЧИТИСЯ');
} else {
    console.log('сидимо вдома і вчимося ОНЛАЙН');
}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let yourNumber = 10;
switch (yourNumber) {
    case 1:
        console.log('Авто');
        break;
    case 2 :
        console.log('Мото');
        break;
    case 3:
        console.log('Телефон');
        break;
    case 4:
        console.log('Скутер');
        break;
    case 5:
        console.log('Ракетв');
        break;
    default :
        console.log('число не вірне');

}
